In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('C:\\Pycharm_Projects\\Pandas_project\\emp.csv',usecols = ['eno','ename','salary'])

In [5]:
df

    eno   ename  salary
0    10   Amber    1000
1     2    Amar    1000
2     8   Sagar    1000
3     4  Thomas    1000
4     5    Jade    2000
5     6   Smith    1000
6     7  Robert    3000
7     3    Nick    1000
8     9   Naman    4000
9     1   Vikas    1000
10   11  Dennis   41000
11   12   Karan    2200
12   13  Simran    1500
13   14    Amit    2000
14   15    Neha    1700
15   16   Rahul    1200

In [4]:
df[['eno','ename','salary']]

    eno   ename  salary
0    10   Amber    1000
1     2    Amar    1000
2     8   Sagar    1000
3     4  Thomas    1000
4     5    Jade    2000
5     6   Smith    1000
6     7  Robert    3000
7     3    Nick    1000
8     9   Naman    4000
9     1   Vikas    1000
10   11  Dennis   41000
11   12   Karan    2200
12   13  Simran    1500
13   14    Amit    2000
14   15    Neha    1700
15   16   Rahul    1200

In [3]:
mydata = {'name':['rohit','nilesh','rahul'],
         'age':[20,52,32]
         }

In [12]:
df = pd.DataFrame(mydata, dtype ='float')

ValueError: could not convert string to float: 'rohit'

In [13]:
df

    eno   ename  salary
0    10   Amber    1000
1     2    Amar    1000
2     8   Sagar    1000
3     4  Thomas    1000
4     5    Jade    2000
5     6   Smith    1000
6     7  Robert    3000
7     3    Nick    1000
8     9   Naman    4000
9     1   Vikas    1000
10   11  Dennis   41000
11   12   Karan    2200
12   13  Simran    1500
13   14    Amit    2000
14   15    Neha    1700
15   16   Rahul    1200

In [14]:
sr = [22,15,3,4]
ds = pd.Series(sr,dtype = 'float')

In [15]:
ds

0    22.0
1    15.0
2     3.0
3     4.0
dtype: float64

In [20]:
ds1 = pd.Series(mydata, dtype = 'float')

ValueError: could not convert string to float: 'rohit'

In [18]:
ds1

name    [rohit, nilesh, rahul]
age               [20, 52, 32]
dtype: object

In [19]:
type(ds1)

pandas.core.series.Series

In [21]:
pd.Series(20)

0    20
dtype: int64

In [22]:
df = pd.DataFrame(sr)

In [23]:
df

    0
0  22
1  15
2   3
3   4

In [25]:
mydata

{'name': ['rohit', 'nilesh', 'rahul'], 'age': [20, 52, 32]}

In [32]:
df = pd.DataFrame(mydata['name'])

In [35]:
df[0][2]

'rahul'

In [36]:
list_1 = [[1,2,3,4],[5,6,7,8],[9,10,11,12]]

In [37]:
dl = pd.DataFrame(list_1)

In [38]:
dl

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [39]:
lis1 = pd.DataFrame({'A':[1,2,3,4,5],
                     'B':[20,43,15,60,12]
})

In [41]:
lis1['C'] = lis1['A']+lis1['B']

In [43]:
pd.DataFrame(lis1['C'])

    C
0  21
1  45
2  18
3  64
4  17

In [44]:
lis1['C'] = lis1['B'] <= 20

In [46]:
pd.DataFrame(lis1['C'])

       C
0   True
1  False
2   True
3  False
4   True

In [47]:
mydata

{'name': ['rohit', 'nilesh', 'rahul'], 'age': [20, 52, 32]}

In [48]:
df = pd.DataFrame(mydata)

In [50]:
df.insert(2,'Subject',['Maths','Sceince','Biology'])

In [51]:
df

     name  age  Subject
0   rohit   20    Maths
1  nilesh   52  Sceince
2   rahul   32  Biology

In [52]:
df['C'] = df['Subject'][:3]

In [53]:
df

     name  age  Subject        C
0   rohit   20    Maths    Maths
1  nilesh   52  Sceince  Sceince
2   rahul   32  Biology  Biology

In [54]:
lis1 = pd.DataFrame({'A':[1,2,3,4,5],
                     'B':[20,43,15,60,12]
})

lis1['C'] = lis1['B'][:3]

In [55]:
lis1

   A   B     C
0  1  20  20.0
1  2  43  43.0
2  3  15  15.0
3  4  60   NaN
4  5  12   NaN

In [56]:
df.pop('C')

0      Maths
1    Sceince
2    Biology
Name: C, dtype: object

In [2]:
mydata

NameError: name 'mydata' is not defined

In [6]:
mydata

{'name': ['rohit', 'nilesh', 'rahul'], 'age': [20, 52, 32]}

In [9]:
df = pd.DataFrame(mydata)

In [10]:
df.insert(2,'Subject',['Math','Science','Biology'])

In [11]:
df

     name  age  Subject
0   rohit   20     Math
1  nilesh   52  Science
2   rahul   32  Biology

In [12]:
df.pop('Subject')

0       Math
1    Science
2    Biology
Name: Subject, dtype: object

In [13]:
df

     name  age
0   rohit   20
1  nilesh   52
2   rahul   32

In [21]:
rcsv = pd.read_csv('C:\\Pycharm_Projects\\Pandas_project\\emp.csv', usecols = ['eno','ename'],nrows = 2)

In [22]:
rcsv

   eno  ename
0   10  Amber
1    2   Amar

In [23]:
rcsv = pd.read_csv('C:\\Pycharm_Projects\\Pandas_project\\emp.csv', usecols = [0,3],nrows = 4)

In [24]:
rcsv

   eno  deptno
0   10      10
1    2      10
2    8      20
3    4      10

In [55]:
rcsv = pd.read_csv('C:\\Pycharm_Projects\\Pandas_project\\emp.csv',usecols=['eno','deptno'])

In [56]:
rcsv

    eno  deptno
0    10      10
1     2      10
2     8      20
3     4      10
4     5      10
5     6      10
6     7      20
7     3      30
8     9      30
9     1      30
10   11      30
11   12      20
12   13      10
13   14      30
14   15      20
15   16      10

In [42]:
rcsv.columns

Index(['eno', 'ename', 'salary', 'deptno', 'doj'], dtype='object')

In [43]:
rcsv.index

RangeIndex(start=0, stop=16, step=1)

In [47]:
rcsv.describe()

             eno        salary     deptno
count  16.000000     16.000000  16.000000
mean    8.500000   4100.000000  18.750000
std     4.760952   9877.449063   8.850612
min     1.000000   1000.000000  10.000000
25%     4.750000   1000.000000  10.000000
50%     8.500000   1350.000000  20.000000
75%    12.250000   2050.000000  30.000000
max    16.000000  41000.000000  30.000000

In [48]:
rcsv.head()

   eno   ename  salary  deptno         doj
0   10   Amber    1000      10  2018-05-14
1    2    Amar    1000      10  2017-03-22
2    8   Sagar    1000      20  2020-11-30
3    4  Thomas    1000      10  2019-08-18
4    5    Jade    2000      10  2021-02-10

In [49]:
rcsv.tail()

    eno   ename  salary  deptno         doj
11   12   Karan    2200      20  2018-06-16
12   13  Simran    1500      10  2019-12-19
13   14    Amit    2000      30  2022-04-09
14   15    Neha    1700      20  2021-07-22
15   16   Rahul    1200      10  2016-03-28

In [51]:
rcsv[5:11]

    eno   ename  salary  deptno         doj
5     6   Smith    1000      10  2016-12-01
6     7  Robert    3000      20  2023-06-25
7     3    Nick    1000      30  2015-09-15
8     9   Naman    4000      30  2020-01-20
9     1   Vikas    1000      30  2017-10-03
10   11  Dennis   41000      30  2024-01-05